# FFillPat

## Description
Function FFillPat returns the current fill pattern setting.&lt;BR&gt;
&lt;BR&gt;
Fill patterns and their associated constants can be found in the &lt;A HREF=&quot;../Appendix/appendix.html#fptable&quot;&gt;VectorScript Appendix&lt;/A&gt;.

```pascal
FUNCTION FFillPat : LONGINT;
```

```python

def vs.FFillPat():
    return LONGINT
```

## Examples
```pascal
currFillStyle:=FFillPat;

```

## Version
Availability: from MiniCAD
## Category
* Document Attributes